Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Decodes *object* (taking the current state of the decoder into account) and returns the resulting decoded object. If this is the last call to :meth:`decode` *final* must be true (the default is false). If *final* is true the decoder must decode the input completely and must flush all buffers. If this isn't possible (e.g. because of incomplete byte sequences at the end of the input) it must initiate error handling just like in the stateless case (which might raise an exception).
pl: Dekoduje *przedmiot* (biorąc aktualny stan dekodera pod uwagę) i zwraca wynikły przedmiot dekodera. Jeśli to jest ostatnie wywołanie :meth:`decode` *final* musi być prawdziwe (domyślnie jest fałszywe). Jeśli *final* jest prawdziwe dekoder musi dekodować wejście kompletnie i musi opróżnić wszystkie przestrzenie wymiany. Jeśli to jest niemożliwe (np. z powodu niekompletnych sekwencji bajtów na koniec wejścia) to musi inicjować obsługę błędów tak jak w przypadku bezstanowym (co może zgłaszać wyjątek).

source: Reset the decoder to the initial state.
pl: Resetuj dekoder do stanu początkowego.

source: Return the current state of the decoder. This must be a tuple with two items, the first must be the buffer containing the still undecoded input. The second must be an integer and can be additional state info. (The implementation should make sure that ``0`` is the most common additional state info.) If this additional state info is ``0`` it must be possible to set the decoder to the state which has no input buffered and ``0`` as the additional state info, so that feeding the previously buffered input to the decoder returns it to the previous state without producing any output. (Additional state info that is more complicated than integers can be converted into an integer by marshaling/pickling the info and encoding the bytes of the resulting string into an integer.)
pl: Zwróć stan obecny dekodera. To musi być krotka z dwoma elementami, pierwszy musi być przestrzenią wymiany zawierającą wciąż niezdekodowane wejście. Drugi musi być liczbą całkowitą i może być informacją dodatkową o stanie. (Wypełnienie powinno upewniać się, że ``0`` jest najczęściej spotykaną dodatkową informacją o stanie.) Jeśli ten dodatkowy stan jest ``0`` musi być możliwe ustawienie dekodera na stan który nie ma wejścia w przestrzeni wymiany i ``0`` jako dodatkową wiadomość o stanie, tak że przekazanie poprzednio buforowanego wejścia dla dekodera zwraca go do poprzedniego stanu bez wytwarzania żadnego wyjścia. (Dodatkowe informacje o stanie które są bardziej skomplikowane niż liczby całkowite mogą być zamienione na liczbę całkowitą przez przemaszerowanie/peklowanie informacji i kodujących bajtów wynikłego ciągu znaków do liczby całkowitej.)

source: Set the state of the encoder to *state*. *state* must be a decoder state returned by :meth:`getstate`.
pl: Ustaw stan kodera na *stan* - z ang. - *state*. *stan* musi być stanem dekodera zwróconym przez :meth:`getstate`.

source: The :class:`StreamWriter` and :class:`StreamReader` classes provide generic working interfaces which can be used to implement new encoding submodules very easily. See :mod:`encodings.utf_8` for an example of how this is done.
pl: Uogólnienia :class:`StreamWriter` i :class:`StreamReader` dostarczają zastępczych sprzęgów pracujących, które mogą być użyte do wypełnienia nowych podmodułów kodowania bardzo łatwo. Zobacz moduł :mod:`encodings.uft_8` dla przykładu jak to się robi.

source: StreamWriter Objects
pl: Przedmioty StreamWriter

source: The :class:`StreamWriter` class is a subclass of :class:`Codec` and defines the following methods which every stream writer must define in order to be compatible with the Python codec registry.
pl: Uogólnienie :class:`StreamWriter jest podrzędnym uogólnieniem uogólnienia :class:`Codec` i definiuje następujące sposoby postępowania które każdy piszący do strumienia musi definiować w celu pozostania zgodnym z rejestrem kodeków języka pytonowskiego.

source: Constructor for a :class:`StreamWriter` instance.
pl: Konstruktor dla przykładu uogólnienia :class:`StreamWriter`.

source: All stream writers must provide this constructor interface. They are free to add additional keyword arguments, but only the ones defined here are used by the Python codec registry.
pl: Wszystkie przedmioty piszące do strumienia muszą dostarczać ten sprzęg konstruktora. Mogą dodawać dodatkowe parametry słów kluczowych, ale tylko te zdefiniowane tutaj są użyte przez rejestr kodeków języka pytonowskiego.

source: *stream* must be a file-like object open for writing binary data.
pl: *stream* musi być przedmiotem podobnym-do-pliku otwartym na zapis danych binarnych.

source: The :class:`StreamWriter` may implement different error handling schemes by providing the *errors* keyword argument. These parameters are predefined:
pl: Uogólnienie :class:`StreamWriter` może wypełniać różne schematy obsługi błędów przez dostarczanie parametru słowa kluczowego *errors*. Te parametry są zdefiniowane uprzednio:

source: The *errors* argument will be assigned to an attribute of the same name. Assigning to this attribute makes it possible to switch between different error handling strategies during the lifetime of the :class:`StreamWriter` object.
pl: Parametr *errors* zostanie przypisany do właściwości o tej samej nazwie. Przypisanie do tej właściwości powoduje że możliwa jest zamiana pomiędzy rożnymi strategiami obsługi błędów w czasie bytowania przedmiotu :class:`StreamWriter`.

source: Writes the object's contents encoded to the stream.
pl: Zapisuje zawartość przedmiotu zakodowanego do strumienia.

source: Writes the concatenated list of strings to the stream (possibly by reusing the :meth:`write` method).
pl: Zapisuje połączona listę ciągów znaków do strumienia (możliwie przez ponowne użycie sposobu postępowania :meth:`write`).

source: Flushes and resets the codec buffers used for keeping state.
pl: Opróżnia i resetuje przestrzenie wymiany kodeka używane dla utrzymania stanu.

source: Calling this method should ensure that the data on the output is put into a clean state that allows appending of new fresh data without having to rescan the whole stream to recover state.
pl: Wywołanie tego sposobu postępowania powinno pozwalać na to by dane na wyjściu były włożone do czystego stanu który pozwala na dopisywanie nowych świeżych danych bez konieczności ponownego skanowania całego strumienia dla przywrócenia stanu.

source: In addition to the above methods, the :class:`StreamWriter` must also inherit all other methods and attributes from the underlying stream.
pl: W dodatku do powyższych sposobów postępowania, uogólnienie :class:`StreamWriter` musi także dziedziczyć wszystkie inne sposoby postępowania i właściwości z leżącego u podstaw strumienia.

source: StreamReader Objects
pl: Przedmioty StreamReader

source: The :class:`StreamReader` class is a subclass of :class:`Codec` and defines the following methods which every stream reader must define in order to be compatible with the Python codec registry.
pl: Uogólnienie :class:`StreamReader` jest podrzędnym uogólnieniem uogólnienia :class:`Codec` i definiuje następujące sposoby postępowania które każdy czytający ze strumienia musi określać w celu aby zachować zgodność z rejestrem kodeków języka pytonowskiego.

source: Constructor for a :class:`StreamReader` instance.
pl: Konstruktor dla przykładu uogólnienia :class:`StreamReader`.

source: All stream readers must provide this constructor interface. They are free to add additional keyword arguments, but only the ones defined here are used by the Python codec registry.
pl: Wszystkie czytniki strumienia muszą dostarczać ten sprzęg konstruktora. Mogą dodawać dodatkowe parametry słów kluczowych, ale tylko te zdefiniowane tutaj są używane przez rejestr kodeków języka pytonowskiego.

source: *stream* must be a file-like object open for reading (binary) data.
pl: *stream* musi być pliko-podobnym przedmiotem otwartym dla wczytywania (binarnych) danych.

source: The :class:`StreamReader` may implement different error handling schemes by providing the *errors* keyword argument. These parameters are defined:
pl: Uogólnienie :class:`StreamReader` może wypełniać różne schematy obsługi błędów przez dostarczenie parametru słowa kluczowego *errors*. Te parametry są określone:

source: The *errors* argument will be assigned to an attribute of the same name. Assigning to this attribute makes it possible to switch between different error handling strategies during the lifetime of the :class:`StreamReader` object.
pl: Parametr *errors* zostanie przypisany do właściwości o tej samej nazwie. Przypisanie do właściwości umożliwia zamianę pomiędzy różnymi strategiami obsługi błędów w czasie życia przedmiotu :class:`StreamReader`.

source: Decodes data from the stream and returns the resulting object.
pl: Dekoduje dane ze strumienia i zwraca wynikły przedmiot.

source: *chars* indicates the number of characters to read from the stream. :func:`read` will never return more than *chars* characters, but it might return less, if there are not enough characters available.
pl: *chars* wskazuje liczbę znaków do wczytania ze strumienia. :func:`read` nigdy nie zwróci więcej znaków niż *chars*, ale może zwrócić mniej, jeśli nie ma dość znaków dostępnych.

source: *size* indicates the approximate maximum number of bytes to read from the stream for decoding purposes. The decoder can modify this setting as appropriate. The default value -1 indicates to read and decode as much as possible. *size* is intended to prevent having to decode huge files in one step.
pl: *size* wskazuje przybliżoną maksymalną ilość bajtów wczytywanych ze strumienia do celów dekodowania. Dekoder może zmienić to ustawienie jak uważa za stosowne. Domyślna wartość -1 wskazuje wczytywanie i dekodowanie tak dużo jak to tylko możliwe. *size* jest pomyślany aby zapobiec konieczności dekodowania dużych plików w jednym kroku.

source: *firstline* indicates that it would be sufficient to only return the first line, if there are decoding errors on later lines.
pl: *firstline* wskazuje, że to byłoby wystarczające zwrócić tylko pierwszą linię, jeśli wystąpią błędy dekodowania w późniejszych liniach.

source: The method should use a greedy read strategy meaning that it should read as much data as is allowed within the definition of the encoding and the given size, e.g. if optional encoding endings or state markers are available on the stream, these should be read too.
pl: Ten sposób postępowania powinien użyć zachłannej strategii wczytywania w znaczeniu że powinien wczytać tak dużo danych jak to jest dozwolone w definicji kodowania i danym rozmiarze, np. jeśli opcjonalne zakończenia kodowań lub znaczniki stanu są dostępne w strumieniu, wtedy te powinny być także wczytane.

source: Read one line from the input stream and return the decoded data.
pl: Wczytaj jedną linię ze strumienia wejściowego i zwróć zdekodowane dane.

source: *size*, if given, is passed as size argument to the stream's :meth:`readline` method.
pl: *size*, jeśli dany jest przykazywany jako parametr rozmiaru do sposobu postępowania :meth:`readline` dla strumienia.

source: If *keepends* is false line-endings will be stripped from the lines returned.
pl: Jeśli *keepends* jest fałszywe zakończenia linii będą zdjęte ze zwróconych linii.

source: Read all lines available on the input stream and return them as a list of lines.
pl: Wczytaj wszystkie linie dostępne w strumieniu wejściowym i zwróć je jako listę linii.

source: Line-endings are implemented using the codec's decoder method and are included in the list entries if *keepends* is true.
pl: Zakończenia-linii są wypełnione używając sposobu postępowania dekodera należącego do kodeka i są zawarte w liście wpisów jeśli *keepends* jest prawdziwe.

source: *sizehint*, if given, is passed as the *size* argument to the stream's :meth:`read` method.
pl: *sizehint*, jeśli dany jest przekazywany jako parametr *size* dla sposobu postępowania :meth:`read` należącego do strumienia.

source: Resets the codec buffers used for keeping state.
pl: Resetuje przestrzenie wymiany kodeków używanych dla utrzymywania stanu.

source: Note that no stream repositioning should take place. This method is primarily intended to be able to recover from decoding errors.
pl: Zauważ że żadne powtórne pozycjonowanie strumienia nie powinno mieć miejsca. Ten sposób postępowania jest przede wszystkim przeznaczony do umożliwienia podniesienia się z błędów dekodowania.

source: In addition to the above methods, the :class:`StreamReader` must also inherit all other methods and attributes from the underlying stream.
pl: W dodatku do powyższych sposobów postępowania, uogólnienie :class:`StreamReader` musi także dziedziczyć wszystkie inne sposoby postępowania i właściwości z leżącego u podstaw strumienia.

source: The next two base classes are included for convenience. They are not needed by the codec registry, but may provide useful in practice.
pl: Następne dwa uogólnienia podstawowe są załączone dla udogodnienia. Nie są konieczne dla rejestru kodeków, ale mogą okazać się użyteczne w praktyce.

source: StreamReaderWriter Objects
pl: Przedmioty StreamReaderWriter

source: The :class:`StreamReaderWriter` allows wrapping streams which work in both read and write modes.
pl: Uogólnienie :class:`StreamReaderWriter` pozwala opakowywać strumienie które pracują w trybach zarówno odczytu jak i zapisu.

source: The design is such that one can use the factory functions returned by the :func:`lookup` function to construct the instance.
pl: Plan pozwala na to by użyć zadania fabrykującego zwracanego przez zadanie :func:`lookup` aby skonstruować przykład.

source: Creates a :class:`StreamReaderWriter` instance. *stream* must be a file-like object. *Reader* and *Writer* must be factory functions or classes providing the :class:`StreamReader` and :class:`StreamWriter` interface resp. Error handling is done in the same way as defined for the stream readers and writers.
pl: Tworzy przykład uogólnienia :class:`StreamReaderWriter`. *strumień* - z ang. - *stream* musi być pliko-podobnym przedmiotem. *Czytnik* i *Pisak* - z ang. - *Reader* i *Writer* muszą być zadaniami fabrykującymi lub uogólnieniami dostarczającymi sprzęgi :class:`StreamReader` i :class:`StreamWriter` odpowiednio. Obsługa błędów jest wykonywana w ten sam sposób jak określono dla czytnika i piszącego z/do strumienia.

source: :class:`StreamReaderWriter` instances define the combined interfaces of :class:`StreamReader` and :class:`StreamWriter` classes. They inherit all other methods and attributes from the underlying stream.
pl: przykłady :class:`StreamReaderWriter` określają połączone sprzęgi uogólnień :class:`StreamReader` i :class:`StreamWriter`. One dziedziczą wszystkie pozostałe sposoby postępowania i właściwości z leżącego u podstaw strumienia.

source: StreamRecoder Objects
pl: Przedmioty StreamRecoder

source: The :class:`StreamRecoder` provide a frontend - backend view of encoding data which is sometimes useful when dealing with different encoding environments.
pl: Uogólnienie :class:`StreamRecorder` dostarcza widok przedni i tylni zakodowania danych który jest czasami użyteczny gdy mamy do czynienia z różnymi środowiskami kodowania.

source: Creates a :class:`StreamRecoder` instance which implements a two-way conversion: *encode* and *decode* work on the frontend (the input to :meth:`read` and output of :meth:`write`) while *Reader* and *Writer* work on the backend (reading and writing to the stream).
pl: Tworzy przykład :class:`StreamRecoder` który wypełnia dwu-kierunkową konwersję: *encode* i *decode* pracują na przednim końcu (wejściu do :meth:`read` i wyjściu ze sposobu postępowania :meth:`write`) podczas gdy *Reader* i *Writer* pracują z tyłu (wczytując i zapisując z/do strumienia).

source: You can use these objects to do transparent direct recodings from e.g. Latin-1 to UTF-8 and back.
pl: Możesz używać tych przedmiotów aby wykonywać przezroczyste bezpośrednie powtórne kodowania z np. Latin-1 do UTF-8 i z powrotem.

source: *stream* must be a file-like object.
pl: *stream* musi być pliko-podobnym przedmiotem.

source: *encode*, *decode* must adhere to the :class:`Codec` interface. *Reader*, *Writer* must be factory functions or classes providing objects of the :class:`StreamReader` and :class:`StreamWriter` interface respectively.
pl: *encode*, *decode* musi stosować się do sprzęgu :class:`Codec`. *Reader* i *Writer* muszą być zdaniami fabrykującymi lub uogólnieniami dostarczającymi przedmiotów sprzęgów uogólnienia :class:`StreamReader` i :class:`StreamWriter` odpowiednio.

source: *encode* and *decode* are needed for the frontend translation, *Reader* and *Writer* for the backend translation.
pl: *encode* i *decode* - z ang. - *koduj* i *dekoduj* są potrzebne dla tłumaczenia przedniego, *Reader* i *Writer* dla tłumaczenia tylniego.

source: Error handling is done in the same way as defined for the stream readers and writers.
pl: Obsługa błędów jest wykonywana w ten sam sposób jak określono dla czytników i piszących do i ze strumienia.

source: :class:`StreamRecoder` instances define the combined interfaces of :class:`StreamReader` and :class:`StreamWriter` classes. They inherit all other methods and attributes from the underlying stream.
pl: przykłady :class:`StreamRecoder` definiują połączone sprzęgi uogólnień :class:`StreamReader` i :class:`StreamWriter`. One dziedziczą wszystkie inne sposoby postępowania i właściwości z leżącego u podstaw strumienia.

source: Encodings and Unicode
pl: Kodowania i kod Unicode

source: Strings are stored internally as sequences of codepoints (to be precise as :ctype:`Py_UNICODE` arrays). Depending on the way Python is compiled (either via :option:`--without-wide-unicode` or :option:`--with-wide-unicode`, with the former being the default) :ctype:`Py_UNICODE` is either a 16-bit or 32-bit data type. Once a string object is used outside of CPU and memory, CPU endianness and how these arrays are stored as bytes become an issue. Transforming a string object into a sequence of bytes is called encoding and recreating the string object from the sequence of bytes is known as decoding. There are many different methods for how this transformation can be done (these methods are also called encodings). The simplest method is to map the codepoints 0-255 to the bytes ``0x0``-``0xff``. This means that a string object that contains codepoints above ``U+00FF`` can't be encoded with this method (which is called ``'latin-1'`` or ``'iso-8859-1'``). :func:`str.encode` will raise a :exc:`UnicodeEncodeError` that looks like this: ``UnicodeEncodeError: 'latin-1' codec can't encode character '\u1234' in position 3: ordinal not in range(256)``.
pl: Ciągi są zachowywane wewnętrznie jako sekwencje punktów kodowych (dla ścisłości jako tablice :ctype:`Py_UNICODE`). W zależności od sposobu w jaki język pytonowski jest kompilowany (albo przez :option:`--without-wide-unicode` lub :option:`--with-wide-unicode`, z tym pierwszym będącym domyślnym) :ctype:`Py_UNICODE` jest albo 16-bitowym albo 32-bitowym typem danych. Gdy ciąg znaków jest używany poza CPU i pamiecią, endianowość CPU i to jak te tabele są zachowywane jako bajty zaczyna być problemem. Transformowanie przedmiotu ciągu znaków do sekwencji bajtów jest zwane kodowaniem a odtwarzanie przedmiotu ciągu znaków z sekwencji bajtów jest znane jako dekodowanie. Istnieje wiele różnych metod na to jak ta transformacja może być dokonywana (te sposoby postępowania są także zwane kodowaniami) Najprostszym sposobem postępowania jest mapowanie punktów kodu 0-255 na bajty ``0x0`` - ``0xff``. To oznacza, że przedmiot ciągu znaków który zawiera punkty kodowe powyżej ``U+00FF`` nie może być zakodowany tą metodą (która znana jest pod nazwą ``'latin-1'`` lub ``'iso-8859-1'``). :func:`str.encode` będzie zgłaszało wyjątek :exc:`UnicodeEncodeError` który wygląda następująco: ``UnicodeEncodeError: 'latin-1' codec can't encode character '\u1234' in position 3: ordinal not in range(256)``

source: There's another group of encodings (the so called charmap encodings) that choose a different subset of all Unicode code points and how these codepoints are mapped to the bytes ``0x0``-``0xff``. To see how this is done simply open e.g. :file:`encodings/cp1252.py` (which is an encoding that is used primarily on Windows). There's a string constant with 256 characters that shows you which character is mapped to which byte value.
pl: Istnieje inna grupa kodowań (tak zwanych kodowań mapy znaków) które wybrały inny podzbiór wszystkich punktów kodowych Unicode i to jak te punkty kodowe są mapowane na bajty ``0x0`` - ``0xff``. Aby zobaczyć jak to się robi po prostu otwórz np. :file:`encodings/cp1252.py` (które jest kodowaniem, które jest używane głównie na Windows). Istnieje stała ciągu znaków z 256 znakami które pokazują ci, który znak jest przyporządkowany do której wartości bajtu.
